{
  "100": "Tiếp tục: Phần đầu tiên của yêu cầu đã được máy chủ nhận và không bị từ chối.",
  "101": "Chuyển đổi giao thức: Máy chủ đang chuyển đổi giao thức theo yêu cầu của client.",
  "200": "Thành công: Yêu cầu đã thành công.",
  "201": "Đã tạo: Yêu cầu đã hoàn thành và tài nguyên mới đã được tạo.",
  "202": "Đã chấp nhận: Yêu cầu đã được chấp nhận nhưng chưa hoàn thành xử lý.",
  "203": "Thông tin không đáng tin cậy: Máy chủ đã xử lý yêu cầu thành công nhưng đang trả về thông tin từ nguồn khác.",
  "204": "Không có nội dung: Máy chủ đã xử lý yêu cầu thành công và không trả về nội dung.",
  "205": "Đặt lại nội dung: Máy chủ đã xử lý yêu cầu thành công và user agent cần đặt lại view tài liệu.",
  "206": "Nội dung một phần: Máy chủ đang cung cấp một phần của tài nguyên theo yêu cầu range header của client.",
  "300": "Nhiều lựa chọn: Chỉ ra nhiều tùy chọn cho tài nguyên mà client có thể theo.",
  "301": "Di chuyển vĩnh viễn: Tất cả các yêu cầu trong tương lai nên được chuyển hướng đến URI đã chỉ định.",
  "302": "Tìm thấy: Tài nguyên tạm thời tồn tại dưới URI khác.",
  "303": "Xem khác: Có thể tìm thấy phản hồi tại URI khác bằng phương thức GET.",
  "304": "Chưa sửa đổi: Cho biết tài nguyên chưa được sửa đổi kể từ yêu cầu lần trước.",
  "305": "Sử dụng proxy: Tài nguyên được yêu cầu phải được truy cập thông qua proxy được chỉ định trong trường location.",
  "307": "Chuyển hướng tạm thời: Yêu cầu nên được lặp lại với URI khác nhưng các yêu cầu trong tương lai nên sử dụng URI gốc.",
  "400": "Yêu cầu không hợp lệ: Có lỗi trong dữ liệu được gửi đến máy chủ.",
  "401": "Chưa xác thực: Cần xác thực hoặc tài khoản chưa được xác minh.",
  "402": "Cần thanh toán: Được dành riêng và có thể được sử dụng với các yêu cầu quá mức.",
  "403": "Bị cấm: Client không có quyền truy cập vào nội dung.",
  "404": "Không tìm thấy: Máy chủ không thể tìm thấy tài nguyên được yêu cầu.",
  "405": "Phương thức không được phép: Phương thức yêu cầu không được hỗ trợ cho tài nguyên được yêu cầu.",
  "406": "Không thể chấp nhận: Máy chủ không thể đáp ứng các đặc tính của nội dung mà client yêu cầu.",
  "407": "Cần xác thực proxy: Client phải xác thực với proxy trước.",
  "408": "Hết thời gian yêu cầu: Máy chủ đã hết thời gian chờ yêu cầu.",
  "409": "Xung đột: Yêu cầu xung đột với trạng thái hiện tại của máy chủ.",
  "410": "Đã biến mất: Tài nguyên không còn khả dụng và sẽ không có sẵn trở lại.",
  "411": "Cần độ dài: Máy chủ cần chỉ định độ dài của dữ liệu upload.",
  "412": "Điều kiện tiên quyết thất bại: Máy chủ không đáp ứng các điều kiện tiên quyết mà client đặt ra trong yêu cầu.",
  "413": "Payload quá lớn: Request entity vượt quá giá trị tối đa mà máy chủ có thể xử lý.",
  "414": "URI quá dài: URI được cung cấp quá dài để máy chủ xử lý.",
  "415": "Loại media không được hỗ trợ: Định dạng media của dữ liệu yêu cầu không được máy chủ hỗ trợ.",
  "416": "Không thể đáp ứng phạm vi: Không thể đáp ứng phạm vi được chỉ định trong range header của yêu cầu.",
  "417": "Kỳ vọng thất bại: Máy chủ không thể đáp ứng yêu cầu của trường Expect request header.",
  "500": "Lỗi máy chủ nội bộ: Máy chủ gặp phải tình huống mà nó không biết cách xử lý.",
  "501": "Chưa được triển khai: Phương thức yêu cầu không được máy chủ hỗ trợ và không thể xử lý.",
  "502": "Gateway không hợp lệ: Máy chủ nhận được phản hồi không hợp lệ từ máy chủ upstream.",
  "503": "Dịch vụ không khả dụng: Máy chủ bị quá tải hoặc đang bảo trì và không thể xử lý yêu cầu.",
  "504": "Hết thời gian gateway: Máy chủ không nhận được phản hồi kịp thời từ máy chủ upstream.",
  "505": "Phiên bản HTTP không được hỗ trợ: Máy chủ không hỗ trợ phiên bản giao thức HTTP được sử dụng trong yêu cầu."
}
